[
  {
    "bookId": 1,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "../src/assets/images/book1.png",
    "review": "A timeless classic that beautifully captures the essence of the Roaring Twenties. F. Scott Fitzgerald's 'The Great Gatsby' is a timeless classic that beautifully captures the essence of the Roaring Twenties. Through the eyes of narrator Nick Carraway, readers are transported into the glamorous world of Jay Gatsby, a mysterious millionaire with a penchant for lavish parties and a hidden longing for lost love. Fitzgerald's lyrical prose and vivid imagery paint a portrait of a society intoxicated by wealth, ambition, and desire, yet ultimately disillusioned by the emptiness of the American Dream. 'The Great Gatsby' remains as relevant today as it was nearly a century ago, serving as a poignant reminder of the fleeting nature of happiness and the pursuit of elusive ideals.",
    "totalPages": 180,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Classic", "Romance"],
    "publisher": "Scribner",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 2,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "../src/assets/images/book2.png",
    "review": "A poignant exploration of racial injustice and moral growth in the American South. Harper Lee's 'To Kill a Mockingbird' is a masterpiece that offers a poignant exploration of racial injustice and moral growth in the American South. Set in the fictional town of Maycomb, Alabama, during the 1930s, the novel follows the journey of young Scout Finch as she navigates the turbulent waters of adolescence while witnessing her father, Atticus Finch, defend a black man falsely accused of raping a white woman. Through Scout's innocent yet perceptive eyes, Lee masterfully explores themes of empathy, morality, and the consequences of prejudice. 'To Kill a Mockingbird' is a powerful reminder of the enduring impact of discrimination and the importance of standing up for what is right, even in the face of adversity.",
    "totalPages": 336,
    "rating": 4.8,
    "category": "Fiction",
    "tags": ["Social Justice", "Coming of Age"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 3,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "../src/assets/images/book3.png",
    "review": "A chilling dystopian novel that remains disturbingly relevant in today's society. George Orwell's '1984' is a chilling dystopian novel that remains disturbingly relevant in today's society. Set in a totalitarian regime where individuality and free thought are suppressed, the novel follows the story of Winston Smith as he rebels against the oppressive government led by Big Brother. Orwell's prophetic vision of a surveillance state and the manipulation of truth resonates with contemporary issues such as government surveillance and the erosion of privacy rights. '1984' serves as a stark warning against the dangers of unchecked authority and the importance of preserving freedom and truth in society.",
    "totalPages": 328,
    "rating": 4.6,
    "category": "Science Fiction",
    "tags": ["Dystopian", "Political"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 4,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "../src/assets/images/book4.png",
    "review": "An iconic coming-of-age story that continues to resonate with readers of all ages. J.D. Salinger's 'The Catcher in the Rye' is an iconic coming-of-age story that continues to resonate with readers of all ages. Narrated by the disillusioned teenager Holden Caulfield, the novel captures the angst and alienation of adolescence with unparalleled honesty and authenticity. As Holden navigates the streets of New York City, he grapples with themes of identity, alienation, and the search for meaning in a world that seems increasingly indifferent. Salinger's poignant portrayal of youth and rebellion has cemented 'The Catcher in the Rye' as a timeless classic that speaks to the universal experiences of growing up and finding one's place in the world.",
    "totalPages": 224,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["Coming of Age", "Teenage Rebellion"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 5,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "../src/assets/images/book5.png",
    "review": "A timeless romance with witty social commentary, showcasing Austen's mastery of storytelling. Jane Austen's 'Pride and Prejudice' is a timeless romance with witty social commentary, showcasing Austen's mastery of storytelling. Set in the Regency era, the novel follows the spirited Elizabeth Bennet as she navigates the complexities of love, class, and family expectations. Through Elizabeth's journey of self-discovery and growth, Austen explores themes of marriage, social status, and the importance of individual integrity. With its sharp wit, memorable characters, and timeless romance, 'Pride and Prejudice' remains a beloved classic that continues to captivate readers with its charm and insight into human nature.",
    "totalPages": 432,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Romance", "Regency Era"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "bookId": 6,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "../src/assets/images/book6.png",
    "review": "An enchanting adventure set in Middle-earth, perfect for readers of all ages. J.R.R. Tolkien's 'The Hobbit' is an enchanting adventure set in Middle-earth, perfect for readers of all ages. The novel follows the journey of Bilbo Baggins, a reluctant hobbit who is swept into an epic quest to reclaim the lost kingdom of Erebor from the fearsome dragon Smaug. Along the way, Bilbo encounters elves, dwarves, wizards, and other fantastical creatures as he embarks on a journey of self-discovery and heroism. With its rich world-building, captivating storytelling, and timeless themes of courage and friendship, 'The Hobbit' continues to captivate readers and inspire generations of fantasy lovers around the world.",
    "totalPages": 310,
    "rating": 4.6,
    "category": "Fantasy",
    "tags": ["Adventure", "Epic Fantasy"],
    "publisher": "Allen & Unwin",
    "yearOfPublishing": 1937
  },
  {
    "bookId": 7,
    "bookName": "The Hunger Games",
    "author": "Suzanne Collins",
    "image": "../src/assets/images/book7.png",
    "review": "A gripping tale of survival and rebellion in a dystopian society, filled with action and heart. A gripping tale of survival and rebellion in a dystopian society, filled with action and heart. Suzanne Collins' The Hunger Games transports readers to a future world where the Capitol holds absolute power over its twelve districts. Every year, to remind the districts of its authority, the Capitol forces two children from each district to participate in a televised fight to the death known as the Hunger Games. When Katniss Everdeen volunteers to take her sister's place in the Games, she becomes a symbol of hope and defiance in the face of tyranny. Collins' electrifying prose and relentless pacing keep readers on the edge of their seats as they follow Katniss's journey from reluctant tribute to revolutionary hero. With its themes of oppression, resistance, and the resilience of the human spirit, The Hunger Games is a gripping and thought-provoking read that leaves a lasting impact on readers long after the final page.",
    "totalPages": 374,
    "rating": 4.4,
    "category": "Young Adult",
    "tags": ["Dystopian", "Adventure"],
    "publisher": "Scholastic Press",
    "yearOfPublishing": 2008
  },
  {
    "bookId": 8,
    "bookName": "The Da Vinci Code",
    "author": "Dan Brown",
    "image": "../src/assets/images/book8.png",
    "review": "An intriguing thriller that combines art, religion, and mystery into a gripping narrative. An intriguing thriller that combines art, religion, and mystery into a gripping narrative. Dan Brown's The Da Vinci Code follows symbologist Robert Langdon as he unravels a series of cryptic clues that lead to a shocking discovery about the true nature of Christianity. From the halls of the Louvre to the ancient streets of Rome, Langdon races against time to unravel a centuries-old mystery that could shake the foundations of modern religion. Brown's fast-paced storytelling and intricate plot twists keep readers guessing until the very end, making The Da Vinci Code a thrilling page-turner that's impossible to put down. With its blend of historical intrigue, religious symbolism, and high-stakes suspense, The Da Vinci Code has captivated millions of readers around the world and sparked endless debates about faith, art, and the power of knowledge.",
    "totalPages": 592,
    "rating": 4.2,
    "category": "Mystery",
    "tags": ["Thriller", "Conspiracy"],
    "publisher": "Doubleday",
    "yearOfPublishing": 2003
  },
  {
    "bookId": 9,
    "bookName": "Harry Potter and the Philosopher's Stone",
    "author": "J.K. Rowling",
    "image": "../src/assets/images/book9.png",
    "review": "A magical journey into the world of Hogwarts, where friendship and bravery triumph over darkness. A magical journey into the world of Hogwarts, where friendship and bravery triumph over darkness. J.K. Rowling's Harry Potter and the Philosopher's Stone introduces readers to the young wizard Harry Potter as he discovers his true heritage and begins his education at Hogwarts School of Witchcraft and Wizardry. Alongside his loyal friends Ron and Hermione, Harry embarks on a series of adventures that test his courage, loyalty, and magical abilities. Rowling's richly imagined world and engaging characters captivate readers from the very first page, transporting them to a world where magic is real and anything is possible. With its themes of friendship, loyalty, and the power of love, Harry Potter and the Philosopher's Stone is more than just a fantasy novel—it's a timeless tale of hope and resilience that continues to inspire readers of all ages.",
    "totalPages": 332,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": ["Magic", "Wizardry"],
    "publisher": "Bloomsbury",
    "yearOfPublishing": 1997
  }
]
